In [3]:
import numpy as np
import pandas as pd

data = np.round(np.random.normal(size=(4,3)), 2)
df = pd.DataFrame(data, columns=['A','B','C'])
df.head()

      A     B     C
0  1.31  0.10  0.79
1  2.44 -0.63 -1.49
2  1.39  1.34 -2.74
3  2.04 -1.51 -1.11

In [4]:
df.apply(lambda x: 1 + np.abs(x))

      A     B     C
0  2.31  1.10  1.79
1  3.44  1.63  2.49
2  2.39  2.34  3.74
3  3.04  2.51  2.11

In [5]:
df.A.apply(np.abs)

0    1.31
1    2.44
2    1.39
3    2.04
Name: A, dtype: float64

In [6]:
def double_if_positive(x):
    x = x.copy()
    x[x>0] *= 2
    return x

df.apply(double_if_positive, raw = True)

      A     B     C
0  2.62  0.20  1.58
1  4.88 -0.63 -1.49
2  2.78  2.68 -2.74
3  4.08 -1.51 -1.11

# Map

In [8]:
series = pd.Series(['Ahmad','Tayyab','Ali'])
series.map({'Tayyab':'Maqsood'})

0        NaN
1    Maqsood
2        NaN
dtype: object

In [9]:
series.map(lambda d: f"I am {d}")

0     I am Ahmad
1    I am Tayyab
2       I am Ali
dtype: object

## Vectorised Function

In [10]:
display(df,df.abs())

      A     B     C
0  1.31  0.10  0.79
1  2.44 -0.63 -1.49
2  1.39  1.34 -2.74
3  2.04 -1.51 -1.11

      A     B     C
0  1.31  0.10  0.79
1  2.44  0.63  1.49
2  1.39  1.34  2.74
3  2.04  1.51  1.11

In [12]:
series.str.contains('Ahmad')

0     True
1    False
2    False
dtype: bool

In [15]:
series.str.upper()

0     AHMAD
1    TAYYAB
2       ALI
dtype: object

In [17]:
data = np.random.normal(10, 2, size = (10000, 2))
df2 = pd.DataFrame(data, columns = ['x','y'])
df2.head()

           x          y
0   8.654761  11.457636
1  12.846583  10.873338
2   6.379450   7.187455
3  13.202071  10.428485
4   9.376317  10.655509